        IDENTIFICATION DIVISION.
        PROGRAM-ID.  Basic3.
        PROCEDURE DIVISION.
        0000-MAIN.
            DISPLAY 'Hello there,' ' my name is: ' 'Jon'
                ', and ' WITH NO ADVANCING.
            DISPLAY 'my ID number is: '  855.
            STOP RUN.

