        IDENTIFICATION DIVISION.
        PROGRAM-ID.  Basic1.
        PROCEDURE DIVISION.
        0000-MAIN.
           DISPLAY 'Hello There.'.
           STOP RUN.
