       IDENTIFICATION DIVISION.
       PROGRAM-ID.  Basic2.
       PROCEDURE DIVISION.
       0000-MAIN.
            DISPLAY 'Hello there,' ' my name is: ' 'Jon'
                 ', and '.
            DISPLAY 'my ID number is: '  855.
            STOP RUN.

