       IDENTIFICATION DIVISION.
       PROGRAM-ID.  SUBPRG1.

       PROCEDURE DIVISION.
       0100-MAIN.
           DISPLAY 'EXECUTING SUB PROGRAM'.
           EXIT PROGRAM.
