           BIND RUN-UNIT
           PERFORM IDMS-STATUS
           BIND JOB
           PERFORM IDMS-STATUS
           BIND EMPOSITION
           PERFORM IDMS-STATUS
           BIND EMPLOYEE
           PERFORM IDMS-STATUS
           READY EMP-DEMO-REGION USAGE-MODE RETRIEVAL.
           PERFORM IDMS-STATUS.
           READY ORG-DEMO-REGION USAGE-MODE RETRIEVAL.
           PERFORM IDMS-STATUS.
