           INITIALIZE EMPLOYEE-REC
           MOVE ‘1231231234’ TO EMPLOYEE-NUM
           MOVE ‘JONES’ TO EMPLOYEE-LAST-NAME
           MOVE ‘JOHN’ TO EMPLOYEE-FIRST-NAME
           STORE EMPLOYEE-REC
           PERFORM IDMS-STATUS
