       1000-GET-EMPLOYEE.
           OBTAIN CALC EMPLOYEE-REC
           PERFORM IDMS-STATUS
           PERFORM 2100-DISPLAY-RESULT THRU 2100-EXIT
           PERFORM 2000-GET-DUP-EMPLOYEES THRU 2000-EXIT
              UNTIL DB-REC-NOT-FOUND.
       1000-EXIT. EXIT.

       2000-GET-DUP-EMPLOYEES.
           OBTAIN CALC EMPLOYEE-REC DUPLICATE.
           IF NOT DB-REC-NOT-FOUND
              PERFORM IDMS-STATUS
              PERFORM 2100-DISPLAY-RESULT THRU 2100-EXIT
            .
       2000-EXIT. EXIT.

       2100-DISPLAY-NAME.
           IF DB-REC-NOT-FOUND
              DISPLAY ‘ EMPLOYEE-NUM=‘ EMPLOYEE-NUM
                      ‘WAS NOT FOUND’
           ELSE
              DISPLAY ‘ EMPLOYEE-NUM=‘ EMPLOYEE-NUM
                      ‘ EMPLOYEE-NAME=‘ EMPLOYEE-NAME
           END-IF.
      2100-EXIT. EXIT.
