IDENTIFICATION DIVISION.
PROGRAM-ID.  Numbers1.
DATA DIVISION.
WORKING-STORAGE SECTION.
  UNSIGN-AN.
    05  UNSIGNED-DIGIT        PIC 9 VALUE ZERO.
  NEGATIVE-AN.
    05  NEGATIVE-DIGIT        PIC S9.
  POSITIVE-AN
    05  POSITIVE-DIGIT        PIC S9.
PROCEDURE DIVISION.
-MAIN.
    DISPLAY ‘DIGIT NEGATIVE POSITIVE’.
    PERFORM 0100-LOOP 10 TIMES.
    STOP RUN.
-LOOP.
    MULTIPLY UNSIGNED-DIGIT BY -1 GIVING NEGATIVE-DIGIT.
    MULTIPLY NEGATIVE-DIGIT BY -1 GIVING POSITIVE-DIGIT.
    DISPLAY ‘  ‘ UNSIGND-AN ‘      ‘ NEGATIVE-AN
        ‘         ‘ POSITIVE-AN.
    ADD 1 TO UNSIGNED-DIGIT.
